// 目前先配置两个页面的数据
// 后面网站规模上来了 考虑动态博客

const classNameMap = {
    h1: 'text-2xl font-bold text-gray-800 mb-4',
    p: 'text-gray-700 leading-relaxed py-3'
};

export const journey_to_west_worldview = {
    poster: {
        url: '/blog/worldview.map.jpg',
        w: 800,
        h: 563
    },
    list: [
        {
            attr: 'h1',
            classname: classNameMap.h1,
            content: '西游记的世界观设定'
        },
        {
            attr: 'p',
            classname: classNameMap.p,
            content: `
                《西游记》的世界观十分有意思，它实际上是佛道儒三家的混合体，不仅有着修仙的神仙，同样也有修禅的佛祖。
                在这种混杂的世界观中有着不同的位面，包括人界、仙界、神界、魔界、妖界和冥界
                妖精鬼怪，神佛仙魔
            `
        },
        {
            attr: 'p',
            classname: classNameMap.p,
            content: `
                人：指的是凡间的人类，他们生活在南赡部洲的一个国家，即东土大唐。在《西游记》的世界观中，人处于较为弱势的地位，需要面对各种妖魔鬼怪的威胁，同时也受到神仙和佛祖的庇护和指引。
            
            `
        },
        {
            attr: 'p',
            classname: classNameMap.p,
            content: `
                妖：由畜生修炼而成，具有人形或近似人形，白天晚上均可活动。它们大多都是来自妖界，与人界相邻，这也是为什么人界的妖怪这么多的原因。其中，巡山小妖、即将化形的妖、幻化成人的妖、声名赫赫的妖、袭击大神通者的妖、神仙坐骑、上古妖圣，这些是《西游记》中对妖怪的分类。
            `
        },
        {
            attr: 'p',
            classname: classNameMap.p,
            content: `
                神：包括天仙、地仙、神仙、人仙和鬼仙五类。其中，玉帝、太上老君、托塔天王等都是天仙；居住在蓬莱仙境的福禄寿三星，是神仙的代表；地仙之祖是五庄观的镇元大仙；想霸占唐僧锦斓袈裟的金池长老，属于人仙；城隍土地是鬼仙的代表。
            `
        },
        {
            attr: 'p',
            classname: '',
            content: `
                佛：在《西游记》构建的神佛世界中，分为横竖三世佛。竖三世佛，指时间维度上的三佛，分别是过去佛燃灯佛、现在佛释迦牟尼佛（如来）、未来佛弥勒佛；横三世佛，指空间维度上的三佛，分别是东方净琉璃世界的药师如来、中央娑婆世界的释迦牟尼佛、西方极乐世界的阿弥陀佛。
            `
        }
    ]
};

export const why_monster_wants_to_be_human = {
    poster: {
        url: '/blog/worldview.map.jpg',
        w: 800,
        h: 563
    },
    list: [
        {
            attr: 'h1',
            classname: classNameMap.h1,
            content: '为什么妖怪想要变成人'
        },
        {
            attr: 'p',
            classname: classNameMap.p,
            content: `
                《西游记》的世界观十分有意思，它实际上是佛道儒三家的混合体，不仅有着修仙的神仙，同样也有修禅的佛祖。
                在这种混杂的世界观中有着不同的位面，包括人界、仙界、神界、魔界、妖界和冥界
                妖精鬼怪，神佛仙魔
            `
        },
        {
            attr: 'p',
            classname: classNameMap.p,
            content: `
                人：指的是凡间的人类，他们生活在南赡部洲的一个国家，即东土大唐。在《西游记》的世界观中，人处于较为弱势的地位，需要面对各种妖魔鬼怪的威胁，同时也受到神仙和佛祖的庇护和指引。
            
            `
        },
        {
            attr: 'p',
            classname: classNameMap.p,
            content: `
                妖：由畜生修炼而成，具有人形或近似人形，白天晚上均可活动。它们大多都是来自妖界，与人界相邻，这也是为什么人界的妖怪这么多的原因。其中，巡山小妖、即将化形的妖、幻化成人的妖、声名赫赫的妖、袭击大神通者的妖、神仙坐骑、上古妖圣，这些是《西游记》中对妖怪的分类。
            `
        },
        {
            attr: 'p',
            classname: classNameMap.p,
            content: `
                神：包括天仙、地仙、神仙、人仙和鬼仙五类。其中，玉帝、太上老君、托塔天王等都是天仙；居住在蓬莱仙境的福禄寿三星，是神仙的代表；地仙之祖是五庄观的镇元大仙；想霸占唐僧锦斓袈裟的金池长老，属于人仙；城隍土地是鬼仙的代表。
            `
        },
        {
            attr: 'p',
            classname: '',
            content: `
                佛：在《西游记》构建的神佛世界中，分为横竖三世佛。竖三世佛，指时间维度上的三佛，分别是过去佛燃灯佛、现在佛释迦牟尼佛（如来）、未来佛弥勒佛；横三世佛，指空间维度上的三佛，分别是东方净琉璃世界的药师如来、中央娑婆世界的释迦牟尼佛、西方极乐世界的阿弥陀佛。
            `
        }
    ]
};